HTML & CSS - Design and Build Websites/003.Lists/003.000.Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-08-01 Thu 23:12 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Ch.3 Lists</title>
<meta name="author" content="Alfredo Mejia" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../../scratch/bulma/bulma.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">Ch.3 Lists</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgfec716b">Navigation</a></li>
<li><a href="#orgc83564a">Notes</a>
<ul>
<li><a href="#orgfe72d3b">Section 3.1: Ordered Lists</a></li>
<li><a href="#org79d2a5b">Section 3.2: Unoredered Lists</a></li>
<li><a href="#orgcdf4916">Section 3.3: Definition Lists</a></li>
<li><a href="#org5024257">Section 3.4: Nested Lists</a></li>
<li><a href="#org095920c">Section 3.5: Creating A HTML Page With Lists</a></li>
</ul>
</li>
<li><a href="#org4582a9b">Keywords</a></li>
<li><a href="#org6b46183">Questions</a></li>
<li><a href="#org844c471">Summary</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgfec716b" class="outline-2">
<h2 id="orgfec716b">Navigation</h2>
<div class="outline-text-2" id="text-orgfec716b">
<p>
<b>Home</b>: HTML &amp; CSS - Design and Build Websites [<a href="../000.Home.html">html</a>] [<a href="../000.Home.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites">github</a>]
</p>

<p>
<b>Prev</b>: Ch.2 Text [<a href="../002.Text/002.000.Notes.html">html</a>] [<a href="../002.Text/002.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/002.Text">github</a>]
</p>

<p>
<b>Next</b>: Ch.4 Links [<a href="../004.Links/004.000.Notes.html">html</a>] [<a href="../004.Links/004.000.Notes.html">org</a>] [<a href="https://github.com/alfredo-mejia/notes/tree/main/HTML%20%26%20CSS%20-%20Design%20and%20Build%20Websites/004.Links">github</a>]
</p>
</div>
</div>

<div id="outline-container-orgc83564a" class="outline-2">
<h2 id="orgc83564a">Notes</h2>
<div class="outline-text-2" id="text-orgc83564a">
</div>
<div id="outline-container-orgfe72d3b" class="outline-3">
<h3 id="orgfe72d3b">Section 3.1: Ordered Lists</h3>
<div class="outline-text-3" id="text-orgfe72d3b">
<ul class="org-ul">
<li>Ordered lists are lists where each item in the list is numbered (e.g. set of steps for a recipe where order is important)</li>
<li>The ordered list is created with the <code>&lt;ol&gt;</code> element (this signfies an ordered list but does not create items in the list yet)</li>
<li>Each item in the list is placed between an opening <code>&lt;li&gt;</code> tag and a closing <code>&lt;/li&gt;</code> tag (these are nested inside the <code>&lt;ol&gt;</code> element)</li>
<li>Browsers may indent the list items</li>
<li>You may specify the starting value of the list or even the type of numbering (numbers, letters, roman numerals, etc.) with attributes specified in the <code>&lt;ol&gt;</code> but it is recommended for CSS to take care of that</li>
</ul>
</div>
</div>

<div id="outline-container-org79d2a5b" class="outline-3">
<h3 id="org79d2a5b">Section 3.2: Unoredered Lists</h3>
<div class="outline-text-3" id="text-org79d2a5b">
<ul class="org-ul">
<li>Unordered lists are lists that begin with a bullet point (rather than characters that indicate order)</li>
<li>Unorder list is created with the <code>&lt;ul&gt;</code> element</li>
<li>Each item in the list is placed between an opening <code>&lt;li&gt;</code> tag and a closing <code>&lt;/li&gt;</code> tag</li>
<li>Attributes can be used in the <code>&lt;ul&gt;</code> element to specify the type of bullet point (circles, squares, diamonds, and so on) but CSS can also do that</li>
</ul>
</div>
</div>

<div id="outline-container-orgcdf4916" class="outline-3">
<h3 id="orgcdf4916">Section 3.3: Definition Lists</h3>
<div class="outline-text-3" id="text-orgcdf4916">
<ul class="org-ul">
<li>Definition lists are made up of a set of terms along with the definitions for each of those terms</li>
<li>The definition list is created with the <code>&lt;dl&gt;</code> element and usually consists of a series of terms and their definitions</li>
<li>Inside the <code>&lt;dl&gt;</code> element you will usually see pairs of <code>&lt;dt&gt;</code> and <code>&lt;dd&gt;</code> elements</li>
<li><code>&lt;dt&gt;</code> is used to contain the term being defined (the definition term)</li>
<li><code>&lt;dd&gt;</code> is used to contain the definition (you may see two terms used for the same definition or two different definitions for the same term)</li>
</ul>
</div>
</div>

<div id="outline-container-org5024257" class="outline-3">
<h3 id="org5024257">Section 3.4: Nested Lists</h3>
<div class="outline-text-3" id="text-org5024257">
<ul class="org-ul">
<li>You can always nest lists within other lists</li>
<li>You can put a second list inside an <code>&lt;li&gt;</code> element to create a sublist or nested list</li>
<li>Browsers display nested lists indented further than the parent list (usually browsers will change the style of the bullet point for nested lists)</li>
</ul>
</div>
</div>

<div id="outline-container-org095920c" class="outline-3">
<h3 id="org095920c">Section 3.5: Creating A HTML Page With Lists</h3>
<div class="outline-text-3" id="text-org095920c">
<ul class="org-ul">
<li>We'll create a web page with a main heading followed by an introductory paragraph</li>
<li>It will have an unordered list (to outline ingredients) and an ordered list to describe the steps</li>
<li><a href="./003.005.Creating A HTML Page With Lists/index.html">Here is the finished web page</a></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org4582a9b" class="outline-2">
<h2 id="org4582a9b">Keywords</h2>
<div class="outline-text-2" id="text-org4582a9b">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Term</th>
<th scope="col" class="org-left">Definition</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left"><b>Ordered List</b></td>
<td class="org-left">A list where each item in the list is numbered</td>
</tr>

<tr>
<td class="org-left"><b>Unordered List</b></td>
<td class="org-left">A list where each item in the ist is not numbered</td>
</tr>

<tr>
<td class="org-left"><b>Definition List</b></td>
<td class="org-left">A list made up of a set of terms along with the definitions for each of those terms</td>
</tr>

<tr>
<td class="org-left"><b>List Item</b></td>
<td class="org-left">A single item inside of a list</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org6b46183" class="outline-2">
<h2 id="org6b46183">Questions</h2>
<div class="outline-text-2" id="text-org6b46183">
<ul class="org-ul">
<li><b>Q</b>: Are definition lists still used?
<ul class="org-ul">
<li>Yes it still used because semantically it is different than <code>&lt;ol&gt;</code> or <code>&lt;ul&gt;</code></li>
<li>There is just less occasions that it can be used as key-value pairs</li>
<li>Here is <a href="https://stackoverflow.com/questions/38950923/why-are-ol-and-dl-not-deprecated">Stackoverflow Answer</a> that talks more about the importance of each type of list</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org844c471" class="outline-2">
<h2 id="org844c471">Summary</h2>
<div class="outline-text-2" id="text-org844c471">
<ul class="org-ul">
<li>There are three types of lists: unordered lists, ordered lists, and definition lists</li>
<li>The unordered lists create lists without numeric numbering</li>
<li>The ordered lists create lists with numeric numbering</li>
<li>The definition lists create key-value pairs to list the terms and definitions</li>
<li>Unordered and ordered lists can be modified to change the style of bulleting by using attributes</li>
<li>You can nest lists within other lists</li>
</ul>
</div>
</div>
</div>
</body>
</html>
